app/Http/Controllers/FrontendController.php

    public function home(){
        $featured=Product::where('status','active')->where('is_featured',1)->orderBy('price','DESC')->limit(2)->get();
        $posts=Post::where('status','active')->orderBy('id','DESC')->limit(3)->get();
        $banners=Banner::where('status','active')->limit(3)->orderBy('id','DESC')->get();
        // return $banner;
        $products=Product::where('status','active')->orderBy('id','DESC')->limit(8)->get();
        $Category=Category::where('status','active')->where('is_parent',1)->orderBy('title','ASC')->get();
        // return $Category;
        return view('frontend.index')
                ->with('featured',$featured)
                ->with('posts',$posts)
                ->with('banners',$banners)
                ->with('product_lists',$products)
                ->with('Category_lists',$Category);
---
select * from `banners` where `status` = 'active' order by `id` desc limit 3
select * from `categories` where `status` = 'active' and `is_parent` = 1 order by `title` asc
select * from `posts` where `status` = 'active' order by `id` desc limit 3
select * from `products` where `status` = 'active' order by `id` desc limit 8

    public function blogSearch(Request $request){
        // return $request->all();
        $rcnt_post=Post::where('status','active')->orderBy('id','DESC')->limit(3)->get();
        $posts=Post::orwhere('title','like','%'.$request->search.'%')
            ->orwhere('quote','like','%'.$request->search.'%')
            ->orwhere('summary','like','%'.$request->search.'%')
            ->orwhere('description','like','%'.$request->search.'%')
            ->orwhere('slug','like','%'.$request->search.'%')
            ->orderBy('id','DESC')
            ->paginate(8);
        return view('frontend.pages.blog')->with('posts',$posts)->with('recent_posts',$rcnt_post);
---
select * from `posts` where `status` = 'active' order by `id` desc limit 9 offset 0
select count(*) as aggregate from `posts` where `status` = 'active'